

"""
Користувач має закордонний паспорт EK346743. Він подорожує по різним країнам та має перелік улюблених страв у кожній з них.

Формати даних:

    паспорт: дві великі літери англійської абетки у верхньому регістрі, потім 6 цифр.

    назва країни та страви : не більше 10 літер англійської абетки у нижньому регістрі, перша літера завжди велика


"""


#    Сформувати структуру датасету для дного користувача.


dataset = {
    "EK346743":{
        "ukrain":{"borsh","carrot"},
        "usa":{"icecream","marshmello"},
        "poland":{"varenik","pampushka"}
    }
}
print(dataset)







